TexasInstruments/f29h85x-sdk/source/driverlib/cmpss.h
}

//*****************************************************************************
//
//! Disables the CMPSS diode emulation mode
//!
//! \param base is the base address of the comparator module.
//!
//! This function disables the CMPSS diode emulation mode
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
CMPSS_disableDEmode(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Disable diode emulation mode.
    //

    HWREGH(base + CMPSS_O_COMPDACHCTL2) &=  ~CMPSS_COMPDACHCTL2_DEENABLE;

}

//*****************************************************************************
//
//! Select the CMPSS diode emulation mode DEACTIVE source
//!
//! \param base is the base address of the comparator module.
//! \param deactivesel is the DEACTIVE source select
//!
//! This function selects the CMPSS diode emulation mode DEACTIVE source
//! Valid values for param \e deactivesel are to be referred from
//! \e CMPSS_DEActiveSelect enum.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
CMPSS_selectDEACTIVESource(uint32_t base, uint16_t deactivesel)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT(deactivesel <= 31U);

    //
    // Select diode emulation active source.
    //

    HWREGH(base + CMPSS_O_COMPDACHCTL2) =
                             (HWREGH(base + CMPSS_O_COMPDACHCTL2)  &
                              ~(CMPSS_COMPDACHCTL2_DEACTIVESEL_M)) |
                             (deactivesel << CMPSS_COMPDACHCTL2_DEACTIVESEL_S);

}

//*****************************************************************************
//
//! Sets the shadow value 2 (used in DE mode) of the internal DAC of the high
//! comparator.
//!
//! \param base is the base address of the comparator module.
//! \param dacval is the value actively driven by the DAC.
//!
//! This function sets the 12-bit value driven by the internal DAC of the high
//! comparator. This function will load the value into the shadow register 2
//! from which the actual DAC value register will be loaded in DE mode.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
CMPSS_configHighDACShadowValueDE(uint32_t base, uint16_t dacval)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT(dacval <= 4095U);

    //
    // Configure high comp DAC shadow value 2.
    //
    HWREGH(base + CMPSS_O_DACHVALS2) = (dacval & CMPSS_DACHVALS2_DACVAL_M);
}

//*****************************************************************************
//
//! Sets the shadow value 2 (used in DE mode) of the internal DAC of the low
//! comparator.
//!
//! \param base is the base address of the comparator module.
//! \param dacval is the value actively driven by the DAC.
//!
//! This function sets the 12-bit value driven by the internal DAC of the low
//! comparator. This function will load the value into the shadow register 2
//! from which the actual DAC value register will be loaded in DE mode.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
CMPSS_configLowDACShadowValueDE(uint32_t base, uint16_t dacval)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT(dacval <= 4095U);

    //
    // Configure low comp DAC shadow value 2.
    //
    HWREGH(base + CMPSS_O_DACLVALS2) = (dacval & CMPSS_DACLVALS2_DACVAL_M);
}

//*****************************************************************************
//
//! Select the Blank source group for high comparator.
//!
//! \param base is the base address of the comparator module.
//! \param group is the blank source group
//!
//! This function selects the Blank source group for high comparator(COMPH).
//! Valid values for param \e group can be: CMPSS_EPWM_GROUP_0TO15 or
//! CMPSS_EPWM_GROUP_16TO31.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
CMPSS_selectBlankSourceGroupHigh(uint32_t base, CMPSS_EPWMGroup group)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT((uint16_t)group <= 1U);

    //
    // Configure the Blanking source group.
    //

    HWREGH(base + CMPSS_O_COMPDACHCTL2) =
                                (HWREGH(base + CMPSS_O_COMPDACHCTL2) &
                                 ~CMPSS_COMPDACHCTL2_BLANKSOURCEUSEL) |
                                ((uint16_t)group << CMPSS_BLANKSOURCEUSEL_S);

}

//*****************************************************************************
//
//! Select the Blank source group for low comparator.
//!
//! \param base is the base address of the comparator module.
//! \param group is the blank source group.
//!
//! This function selects the Blank source group for low comparator(COMPL).
//! Valid values for param \e group can be: CMPSS_EPWM_GROUP_0TO15 or
//! CMPSS_EPWM_GROUP_16TO31.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
CMPSS_selectBlankSourceGroupLow(uint32_t base, CMPSS_EPWMGroup group)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT((uint16_t)group <= 1U);

    //
    // Configure the Blanking source group.
    //

    HWREGH(base + CMPSS_O_COMPDACLCTL2) =
                                (HWREGH(base + CMPSS_O_COMPDACLCTL2) &
                                 ~CMPSS_COMPDACLCTL2_BLANKSOURCEUSEL) |
                                ((uint16_t)group << CMPSS_BLANKSOURCEUSEL_S);

}

//*****************************************************************************
//
//! Select the Ramp source group for high comparator.
//!
//! \param base is the base address of the comparator module.
//! \param group is the ramp source group.
//!
//! This function selects the Ramp source group for high comparator(COMPH).
//! Valid values for param \e group can be: CMPSS_EPWM_GROUP_0TO15 or
//! CMPSS_EPWM_GROUP_16TO31.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
CMPSS_selectRampSourceGroupHigh(uint32_t base, CMPSS_EPWMGroup group)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT((uint16_t)group <= 1U);

    //
    // Configure the Blanking source group.
    //

    HWREGH(base + CMPSS_O_COMPDACHCTL2) =
                                    (HWREGH(base + CMPSS_O_COMPDACHCTL2) &
                                     ~CMPSS_COMPDACHCTL2_RAMPSOURCEUSEL) |
                                    ((uint16_t)group << CMPSS_RAMPSOURCEUSEL_S);

